#include "IWDG.h"


/*************************************************************************************************
*名称:	IWDG_Init
*功能:	看门狗初始化配置
*形参: 	prer->u8 rlr->u16
*返回:	无
*说明:	Tout=((4*2^prer)*rlr)/32 (ms)
*************************************************************************************************/
void IWDG_Init(u8 prer,u16 rlr) 
{  
	IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable); //取消寄存器写保护  
	IWDG_SetPrescaler(prer); 											//设置 IWDG 分频系数  
	IWDG_SetReload(rlr);   												//设置 IWDG 装载值  
	IWDG_ReloadCounter(); 												//reload  
	IWDG_Enable();       													//使能看门狗
} 



/*************************************************************************************************
*名称:	IWDG_Feed
*功能:	喂狗函数
*形参: 	无
*返回:	无
*说明:	无
*************************************************************************************************/
void IWDG_Feed(void) 
{  
	IWDG_ReloadCounter();													//reload 
} 
